cf/AccumulationRegisters/ДолгиПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ДолгиПоЗаказам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/AccumulationRegisters/ДолгиПоОтгрузкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ДолгиПоОтгрузкам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияПереданныхТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Documents/ПлатежноеПоручениеВходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПлатежноеПоручениеВходящее</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказНаряд</xr:Item>
				<xr:Item>Document.ИнтернетЗаказПокупателя</xr:Item>
				<xr:Item>BusinessProcess.ИнтернетЗаявка</xr:Item>
				<xr:Item>BusinessProcess.ЗаявкаПокупателя</xr:Item>
				<xr:Item>BusinessProcess.РемонтИнструмента</xr:Item>
				<xr:Item>Document.РеализацияТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ОплатыПоБанковскимКартам</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВПути</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоОтгрузкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсЦБНаДатуПриобретенияВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Comment>Курс валюты взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаЗаполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДСБух</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаСуммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОтгрузки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияПереданныхТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/CommonForms/ПодборЗаказовДляДокументовОплаты/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьТекстЗапроса()
	
	Если Вид=0 Тогда //по заказам
		
		Если НЕ ЭтоВозвратОплаты Тогда
			
			ТекстЗапроса="
			|Выбрать ТЧ.Заказ,ТЧ.Сумма Поместить ТЧ из &ТЧ как ТЧ;
			|
			|Выбрать """" НомерПП, Заказ, Сумма(СуммаОстаток),Сумма(Сумма),Максимум(Закрываем)  из (
			//остатки
			|Выбрать Заказ, СуммаОстаток, 0 Сумма, Ложь Закрываем из РегистрНакопления.ДолгиПоЗаказам.Остатки(,Контрагент=&Контрагент) ГДЕ СуммаОстаток>0 и НЕ Заказ=Неопределено
			|Объединить все
			//плюс движения этого дока
			|Выбрать Заказ, Сумма, 0 , Ложь  из РегистрНакопления.ДолгиПоЗаказам ГДЕ Регистратор=&Регистратор и НЕ Заказ=Неопределено
			|Объединить все
			//плюс выбранные заказы
			|Выбрать Заказ, 0, Сумма, Истина из ТЧ ГДЕ Не Заказ=Неопределено
			|) как ВТ
			|Сгруппировать по Заказ
			|Упорядочить по Заказ.Дата
			|"
			;
			
		Иначе //для возвратов оплат
			
			ТекстЗапроса="
			|Выбрать ТЧ.Заказ,ТЧ.Сумма Поместить ТЧ из &ТЧ как ТЧ
			|;
			//входящие номера платежек
			|Выбрать Ссылка.НомерВходящегоДокумента НомерПП, Заказ Поместить НомераПП из Документ.ПлатежноеПоручениеВходящее.РасшифровкаСуммы ГДЕ Ссылка.Контрагент=&Контрагент и Ссылка.Проведен
			|;
			|
			|Выбрать НомерПП, ВТ.Заказ, Сумма(СуммаОстаток),Сумма(Сумма),Максимум(Закрываем)  из (
			//все платежи поступления ДС идут со знаком+ возвраты со знаком- . В итоге получаем суммы платежей за минусом возвращенных.
			|Выбрать Заказ,Сумма СуммаОстаток,0 Сумма, Ложь Закрываем из РегистрНакопления.ДолгиПоЗаказам ГДЕ Контрагент=&Контрагент и ВидДвижения=Значение(ВидДвиженияНакопления.расход)  и не Заказ=Неопределено
			|объединить все
			//плюс движения этого дока
			|Выбрать  Заказ, -Сумма, 0 , Ложь  из РегистрНакопления.ДолгиПоЗаказам ГДЕ Регистратор=&Регистратор и НЕ Заказ=Неопределено
			|Объединить все
			//плюс выбранные заказы
			|Выбрать  Заказ, 0, Сумма, Истина из ТЧ ГДЕ Не Заказ=Неопределено
			|) как ВТ
			|Левое соединение НомераПП
			|По ВТ.Заказ=НомераПП.Заказ
			|Сгруппировать по НомерПП,ВТ.Заказ
			|Упорядочить по ВТ.Заказ.Дата
			|"
			;
			
		КонецЕсли;
		
	Иначе//по отгрузкам
		
		Если НЕ ЭтоВозвратОплаты Тогда
			
			ТекстЗапроса="
			|Выбрать ТЧ.Заказ, ТЧ.ДокументОтгрузки, ТЧ.Сумма Поместить ТЧ из &ТЧ как ТЧ;
			|
			|Выбрать """" НомерПП, Заказ, ДокументОтгрузки, Сумма(СуммаОстаток),Сумма(Сумма),Максимум(Закрываем)  из (
			//остатки
			|Выбрать Заказ, ДокументОтгрузки, СуммаОстаток, 0 Сумма, Ложь Закрываем из РегистрНакопления.ДолгиПоОтгрузкам.Остатки(,Контрагент=&Контрагент) ГДЕ СуммаОстаток>0  и НЕ ДокументОтгрузки=Неопределено
			|Объединить все
			//плюс движения этого дока
			|Выбрать Заказ, ДокументОтгрузки, Сумма, 0 , Ложь  из РегистрНакопления.ДолгиПоОтгрузкам ГДЕ Регистратор=&Регистратор  и НЕ ДокументОтгрузки=Неопределено
			|Объединить все
			//плюс выбранные заказы
			|Выбрать Заказ, ДокументОтгрузки, 0, Сумма, Истина из ТЧ ГДЕ Не ДокументОтгрузки=Неопределено
			|) как ВТ
			|Сгруппировать по Заказ,ДокументОтгрузки
			|Упорядочить по Заказ.Дата
			|"
			;
			
		Иначе //для возвратов оплат
			
			ТекстЗапроса="
			|Выбрать ТЧ.Заказ, ТЧ.ДокументОтгрузки, ТЧ.Сумма Поместить ТЧ из &ТЧ как ТЧ
			|;
			//входящие номера платежек
			|Выбрать Ссылка.НомерВходящегоДокумента НомерПП, Заказ, ДокументОтгрузки Поместить НомераПП из Документ.ПлатежноеПоручениеВходящее.РасшифровкаСуммы ГДЕ Ссылка.Контрагент=&Контрагент и Ссылка.Проведен
			|;
			|
			|Выбрать НомерПП, ВТ.Заказ, ВТ.ДокументОтгрузки, Сумма(СуммаОстаток),Сумма(Сумма),Максимум(Закрываем)  из (
			//все платежи поступления ДС идут со знаком+ возвраты со знаком- . В итоге получаем суммы платежей за минусом возвращенных.
			|Выбрать Заказ, ДокументОтгрузки, Сумма СуммаОстаток,0 Сумма, Ложь Закрываем из РегистрНакопления.ДолгиПоОтгрузкам ГДЕ Контрагент=&Контрагент и ВидДвижения=Значение(ВидДвиженияНакопления.расход)  и НЕ ДокументОтгрузки=Неопределено
			|объединить все
			//плюс движения этого дока
			|Выбрать  Заказ, ДокументОтгрузки, -Сумма, 0 , Ложь  из РегистрНакопления.ДолгиПоОтгрузкам ГДЕ Регистратор=&Регистратор  и НЕ ДокументОтгрузки=Неопределено
			|Объединить все
			//плюс выбранные заказы
			|Выбрать  Заказ, ДокументОтгрузки, 0, Сумма, Истина из ТЧ ГДЕ Не ДокументОтгрузки=Неопределено
			|) как ВТ
			|Левое соединение НомераПП
			|По ВТ.Заказ=НомераПП.Заказ
			|Сгруппировать по НомерПП,ВТ.Заказ, ВТ.ДокументОтгрузки
			|Упорядочить по ВТ.Заказ.Дата
			|"
			;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
КонецФункции



&НаСервере
Процедура ПрочитатьЗаказы()
						 
	Запрос= Новый Запрос;
	
	Запрос.Текст=ПолучитьТекстЗапроса();
	Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
	Запрос.УстановитьПараметр("Регистратор",ТекущийДокумент);
	Запрос.УстановитьПараметр("ТЧ",ТЧДок.Выгрузить());
	
	ТЗ=Запрос.Выполнить().Выгрузить();
	
	//ДобавитьИнформациюПоСЧФ(ТЗ);
	
	таблЗаказы.Загрузить(ТЗ);
	
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Контрагент 		= Параметры.Контрагент;
	Сумма			= Параметры.Сумма;
	ТекущийДокумент	= Параметры.ТекущийДокумент;
	ТЗ = ПолучитьИзВременногоХранилища(Параметры.АдресРасшифровкиСуммы);
	ТЧДок.Загрузить(ТЗ);
	ЭтоВозвратОплаты = Параметры.ЭтоВозвратОплаты;
	
	ПрочитатьЗаказы();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСуммы()
	
	СуммаАванса=Сумма-таблЗаказы.Итог("Сумма");
	
КонецПроцедуры


&НаСервере
Функция ПолучитьТаблицуЗначенийСтрокой()
	
	НовТабл=ТаблЗаказы.Выгрузить().СкопироватьКолонки();
	
	Для Каждого Строка Из таблЗаказы Цикл
		Если Строка.Сумма>0 Тогда
			ЗаполнитьЗначенияСвойств(НовТабл.Добавить(), Строка);
		КонецЕсли;	
	КонецЦикла;
	
	//аванс
	Если СуммаАванса>0 тогда
		НовСтр=НовТабл.Добавить();
		НовСтр.Заказ=Неопределено;
		НовСтр.Сумма = СуммаАванса;
	КонецЕсли;
	
	Возврат ЗначениеВСтрокуВнутр(НовТабл);
	
КонецФункции


&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(ПолучитьТаблицуЗначенийСтрокой());
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостью();
	ОбновитьСуммы();
	
КонецПроцедуры


&НаКлиенте
Процедура таблЗаказыОплатитьПриИзменении(Элемент)
	
	текДанные = Элементы.таблЗаказы.ТекущиеДанные;
	
	Если текДанные.Закрываем Тогда
		
		ЗакрываемаяСумма 	= Мин(СуммаАванса, текДанные.СуммаОстаток);
		текДанные.Сумма 	= ЗакрываемаяСумма;
		
		Если Не ЗакрываемаяСумма Тогда
			текДанные.Закрываем = Ложь;
		КонецЕсли;
		
	Иначе
		
		текДанные.Сумма = 0;
		
	КонецЕсли;
	
	ОбновитьСуммы();
	
КонецПроцедуры

&НаКлиенте
Процедура таблЗаказыСуммаПриИзменении(Элемент)
	
	текДанные = Элементы.таблЗаказы.ТекущиеДанные;
	
	ОбновитьСуммы();
	
	Если СуммаАванса<0 Тогда
		текДанные.Сумма=текДанные.Сумма+СуммаАванса;
		ОбновитьСуммы();
	КонецЕсли;	
	
	Если текДанные.Сумма>0 Тогда
		текДанные.Закрываем=Истина;
	Иначе
		текДанные.Закрываем=Ложь;
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	УправлениеВидимостью();
	ПрочитатьЗаказы();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
	Элементы.таблЗаказы.ПодчиненныеЭлементы.таблЗаказыНомерПП.Видимость=?(ЭтоВозвратОплаты,Истина,Ложь);
	Элементы.таблЗаказы.ПодчиненныеЭлементы.таблЗаказыДокументОтгрузки.Видимость=?(Вид=0,Ложь,Истина);
КонецПроцедуры	


//&НаСервере
//Процедура ДобавитьИнформациюПоСчф(ТЗ)
//	Запрос=Новый Запрос;
//	Запрос.УстановитьПараметр("ТЗ",ТЗ);
//	Запрос.Текст=
//	"Выбрать  ТЗ.Заказ Поместить Заказы из &ТЗ ТЗ
//	|;
//	|Выбрать Заказ, Номер из Документ.РеализацияТоваров ГДЕ Заказ в (Выбрать Заказы.Заказ из Заказы)
//	|Объединить все
//	|Выбрать Заказ, Номер из Документ.РеализацияПереданныхТоваров ГДЕ Заказ в (Выбрать Заказы.Заказ из Заказы)
//	|Итоги по Заказ
//	|";
//	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	
//	ТЗ.Колонки.Добавить("НомерСчф");
//	Пока Выборка.Следующий() Цикл
//		НомерСчф="";
//		ВыборкаРеализации=Выборка.Выбрать();
//		Пока ВыборкаРеализации.Следующий() Цикл
//			НомерСчф=НомерСчф + ВыборкаРеализации.Номер+"  ";
//		КонецЦикла;
//		
//		Если ЗначениеЗаполнено(НомерСчф) Тогда
//			Отбор=Новый Структура("Заказ",Выборка.Заказ);
//			Строки=ТЗ.НайтиСтроки(Отбор);
//			Для Каждого Заказ из Строки Цикл
//				Заказ.НомерСчф=НомерСчф;
//			КонецЦикла;	
//		КонецЕсли;
//	КонецЦикла;
//	
//КонецПроцедуры
